In [1]:
import pandas as pd

In [45]:
h1n1 = pd.read_csv('./data/external/h1n1_2009.csv', encoding = "ISO-8859-1")
sars = pd.read_csv('./data/external/sars_2003.csv', parse_dates = ['Date'])

In [46]:
h1n1['Date'] = h1n1['Update Time'].apply(lambda x: pd.to_datetime(x.split(' ')[0]))
h1n1 = h1n1.drop(columns = ['Update Time'])

In [54]:
h1n1['world_cases'] = h1n1.loc[h1n1['Country'] == 'Grand Total']['Cases']
h1n1['world_deaths'] = h1n1.loc[h1n1['Country'] == 'Grand Total']['Deaths']

In [81]:
# sorted(h1n1['Country'].unique())
# h1n1.loc[h1n1['Country'] =='Brazil']
h1n1[['Date']]

           Date
0    2009-07-06
1    2009-07-06
2    2009-07-06
3    2009-07-06
4    2009-07-06
...         ...
1817 2009-05-23
1818 2009-05-23
1819 2009-05-23
1820 2009-05-23
1821 2009-05-23

[1822 rows x 1 columns]

In [96]:
h1n1_data = h1n1[['Date']].set_index(['Date'])
for country in ['United States of America', 'Grand Total', 'Brazil', 'China']:
    data_country = h1n1.loc[h1n1['Country'] == country][['Date', 'Cases']].rename(columns = {'Cases' : f'{country} cases'}).set_index(['Date'])
    h1n1_data = h1n1_data.merge(data_country, left_index = True, right_index = True, how = 'right')

In [98]:
h1n1_data.drop_duplicates()

,United States of America cases,Grand Total cases,Brazil cases,China cases
Date,,,,
2009-05-23,6552.0,12022.0,8,11
2009-05-25,6552.0,12515.0,9,15
2009-05-26,6764.0,12954.0,9,20
2009-05-27,6764.0,13398.0,9,22
2009-05-29,7927.0,15510.0,10,30
2009-06-01,8975.0,17410.0,18,52
2009-06-03,10053.0,19273.0,20,69
2009-06-05,11054.0,21940.0,28,89
2009-06-08,13217.0,25288.0,35,108
2009-06-10,13217.0,27737.0,36,142
2009-06-11,13217.0,28774.0,40,174
2009-06-12,13217.0,29669.0,52,188
2009-06-15,17855.0,35928.0,54,318
2009-06-17,NaN,39620.0,79,382
2009-06-19,17855.0,44287.0,96,519
2009-06-22,21449.0,52160.0,131,739
2009-06-24,21449.0,55867.0,334,906
2009-06-26,21449.0,59814.0,399,1089
2009-06-29,NaN,NaN,452,1442
2009-07-01,27717.0,77201.0,680,1518
2009-07-03,33902.0,89921.0,737,1814
2009-07-06,33902.0,94512.0,737,2040

In [37]:
sars.loc[sars['Country'] == 'China']

,Date,Country,Cumulative number of case(s),Number of deaths,Number recovered
9,2003-03-18,China,0,0,0
18,2003-03-19,China,0,0,0
30,2003-03-20,China,0,0,0
43,2003-03-21,China,0,0,0
58,2003-03-22,China,0,0,0
...,...,...,...,...,...
2385,2003-07-07,China,5327,348,4934
2416,2003-07-08,China,5327,348,4934
2447,2003-07-09,China,5327,348,4939
2478,2003-07-10,China,5327,348,4941
2509,2003-07-11,China,5327,348,4941

In [49]:
h1n1.groupby('Date').sum().sort_index()

             Cases  Deaths
Date
2009-05-23   24043   172.0
2009-05-25   25029   182.0
2009-05-26   25904   184.0
2009-05-27   26792   190.0
2009-05-29   31011   198.0
2009-06-01   34808   230.0
2009-06-03   38532   234.0
2009-06-05   43864   250.0
2009-06-08   50560   278.0
2009-06-10   55450   282.0
2009-06-11   57512   288.0
2009-06-12   59302   290.0
2009-06-15   71819   326.0
2009-06-17   79182   334.0
2009-06-19   88514   360.0
2009-06-22  104259   462.0
2009-06-24  111673   476.0
2009-06-26  119567   526.0
2009-06-29   70832   311.0
2009-07-01  154341   664.0
2009-07-03  179781   764.0
2009-07-06  188963   858.0